Top 3 Pandas functions you do not know about (probably)
https://towardsdatascience.com/top-3-pandas-functions-you-dont-know-about-probably-5ae9e1c964c8

**Pandas** is amazing library for data analysis and Data visulaization

**Motive**

code clean

did not reinvent the wheel

**idxmin() idxmax()** : index location of the smallest and largest item

In [1]:
import pandas as pd

In [2]:
z = pd.Series([1,3,-2,8,124,4,-20,1])

In [3]:
z.idxmin()

6

In [4]:
z.idxmax()

4

**DataFrame.ne()** Get Not equal to of dataframe and other, element-wise (binary operator ne).

Among flexible wrappers (eq, ne, le, lt, ge, gt) to comparison operators

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.ne.html

In [5]:
df = pd.DataFrame({'cost': [250, 150, 100],
                   'revenue': [100, 250, 300]},
                  index=['A', 'B', 'C'])

In [6]:
df

   cost  revenue
A   250      100
B   150      250
C   100      300

In [7]:
df['cost'].ne(100)

A     True
B     True
C    False
Name: cost, dtype: bool

In [8]:
df.ne(100)

    cost  revenue
A   True    False
B   True     True
C  False     True

ne() return True if the current value is not the one you have specified and false otherwise

In [9]:
df['cost'].ne(100).idxmax()

'A'

In [10]:
df.ne(100).idxmax()

cost       A
revenue    B
dtype: object

In [11]:
xx = pd.DataFrame()

In [12]:
xx['x'] = [0,0,0,0,0,0,1,3,20,4,3,12,7]

In [13]:
xx

     x
0    0
1    0
2    0
3    0
4    0
5    0
6    1
7    3
8   20
9    4
10   3
11  12
12   7

In [14]:
xx['x'].ne(0)

0     False
1     False
2     False
3     False
4     False
5     False
6      True
7      True
8      True
9      True
10     True
11     True
12     True
Name: x, dtype: bool

In [15]:
xx['x'].ne(0).idxmax()  # first non-zero observation

6

In [16]:
xx.loc[xx['x'].ne(0).idxmax():]

     x
6    1
7    3
8   20
9    4
10   3
11  12
12   7

**nsmallest() nlargest()**

In [17]:
df = pd.DataFrame({
    'Name':['Bob','Mark','Steph','Jess','Becky'],
    'Points':[55,98,46,77,81]
})

In [18]:
df

    Name  Points
0    Bob      55
1   Mark      98
2  Steph      46
3   Jess      77
4  Becky      81

In [19]:
df.nsmallest(3,'Points')

    Name  Points
2  Steph      46
0    Bob      55
3   Jess      77

In [20]:
df.nlargest(2,'Points')

    Name  Points
1   Mark      98
4  Becky      81